Revit 2026 API

# BendingDetailDisplayParametersOptions Enumeration

---

Describes how the parameters will be represented.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum BendingDetailDisplayParametersOptions
```
```vb
Public Enumeration BendingDetailDisplayParametersOptions
```
```cpp
public enum class BendingDetailDisplayParametersOptions
```
```fsharp
type BendingDetailDisplayParametersOptions
```

| Member name | Value | Description |
| --- | --- | --- |
| ByName | 1 | Dimensions that are shown will be labeled using the parameters names. |
| ByValue | 0 | Dimensions that are shown will be labeled using the parameters values. |

#### Reference

Autodesk.Revit.DB.Structure Namespace